import { IPromotions } from "@/interfaces/promotions.interface"

export const SHARES_DATA: IPromotions[] = [
	{
		id: 1,
		name: "Подготовка к школе",
		alias: "promotion-1",
		description: "Все в одном месте, все, что нужно вам!",
		image:
			"https://images.pexels.com/photos/21696/pexels-photo.jpg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",

		products: [
			{
				id: 1,
				title: "Школа снегурочек и тайна пропавшей хранительницы",
				poster:
					"https://basket-12.wbbasket.ru/vol1786/part178684/178684683/images/big/1.webp",
				alias: "promotion-product-1",
				article: 178684683,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок, с одним вместительным отделением для учебных пособий форматом А4, имеет удобную внутреннюю организацию пространства, позволяющую распределить вещи с максимальным комфортом. Его размер 42х30х13см. В основном отделении есть карман для планшета или ноутбука до 16 дюймов, по бокам два кармана на резинке, один внешний на молнии и на спинке потайной для денег, билетов или документов для лучшей сохранности. В боковой карман можно положить бутылку с водой, поэтому отлично подойдет как спортивный рюкзак для похода в бассейн, на тренировку. Черный женский рюкзак имеет качественную фурнитуру, а материалом изготовления является нейлон-полиэстер, что делает его особенно мягким и лёгким. Ткань плотная и водонепроницаемая. Лямки мягкие и регулируются по длине, благодаря чему не давят на плечи. Такой модный легкий рюкзачок из текстиля понравится, как детям, подросткам, так и женщинам. Однотонный рюкзак или с принтом подходит девочкам как для школы с 3 класса, так и для дополнительных занятий. Он универсальный, представлен в 10 расцветках. Носите ране",
				images: [
					"https://basket-12.wbbasket.ru/vol1786/part178684/178684683/images/big/2.webp",
					"https://basket-12.wbbasket.ru/vol1786/part178684/178684683/images/big/3.webp",
					"https://basket-12.wbbasket.ru/vol1786/part178684/178684683/images/big/4.webp",
					"https://basket-12.wbbasket.ru/vol1786/part178684/178684683/images/big/5.webp",
				],
				price: 504,
				subtitle: "Школа снегурочек и тайна пропавшей хранительницы",
				rating: 2.2,
				discount: 2,
				isHit: false,
				new: false,
			},
			{
				id: 2,
				title: "Костюм тройка школьный",
				poster:
					"https://basket-12.wbbasket.ru/vol1719/part171989/171989638/images/big/1.webp",
				alias: "promotion-product-2",
				article: 123124124,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок			",
				images: [
					"https://basket-12.wbbasket.ru/vol1719/part171989/171989638/images/big/2.webp",
					"https://basket-12.wbbasket.ru/vol1719/part171989/171989638/images/big/3.webp",
					"https://basket-12.wbbasket.ru/vol1719/part171989/171989638/images/big/7.webp",
					"https://basket-12.wbbasket.ru/vol1719/part171989/171989638/images/big/8.webp",
				],
				price: 504,
				subtitle: "Костюм тройка школьный",
				rating: 3.5,
				isHit: true,
				new: false,
			},
			{
				id: 3,
				title: "Рюкзак школьный городской",
				poster:
					"https://basket-08.wbbasket.ru/vol1148/part114881/114881433/images/big/1.webp",
				alias: "promotion-product-3",
				article: 314134231,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок, с одним вместительным отделением для учебных пособий форматом А4, имеет удобную внутреннюю организацию пространства, позволяющую распределить вещи с максимальным комфортом. Его размер 42х30х13см. В основном отделении есть карман для планшета или ноутбука до 16 дюймов, по бокам два кармана на резинке, один внешний на молнии и на спинке потайной для денег, билетов или документов для лучшей сохранности. В боковой карман можно положить бутылку с водой, поэтому отлично подойдет как спортивный рюкзак для похода в бассейн, на тренировку. Черный женский рюкзак имеет качественную фурнитуру, а материалом изготовления является нейлон-полиэстер, что делает его особенно мягким и лёгким. Ткань плотная и водонепроницаемая. Лямки мягкие и регулируются по длине, благодаря чему не давят на плечи. Такой модный легкий рюкзачок из текстиля понравится, как детям, подросткам, так и женщинам. Однотонный рюкзак или с принтом подходит девочкам как для школы с 3 класса, так и для дополнительных занятий. Он универсальный, представлен в 10 расцветках. Носите ранец за удобную ручку как сумку на одно плечо или оба - для правильной осанки. Классический портфель гармонично впишется в любой стиль. Самым практичным подарком для подростка будет молодежный рюкзак: на день рождение, 1 сентября, любой другой праздник и просто так. Данная модель эффективна и универсальна, что станет для вас удачной покупкой.				",
				images: [
					"https://basket-08.wbbasket.ru/vol1148/part114881/114881433/images/big/2.webp",
					"https://basket-08.wbbasket.ru/vol1148/part114881/114881433/images/big/3.webp",
					"https://basket-08.wbbasket.ru/vol1148/part114881/114881433/images/big/4.webp",
					"https://basket-08.wbbasket.ru/vol1148/part114881/114881433/images/big/5.webp",
				],
				price: 504,
				subtitle: "Рюкзак школьный городской",
				rating: 3.5,
				isHit: true,
				new: false,
			},
		],
	},
	{
		id: 2,
		alias: "promotion-2",
		name: "Черная пятница",
		description: "Выберите что вам хочется в черную пятницу!",
		image:
			"https://images.pexels.com/photos/5868272/pexels-photo-5868272.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
		products: [
			{
				id: 1,
				title: "Рюкзак спортивный для ноутбука",
				poster:
					"https://basket-12.wbbasket.ru/vol1854/part185478/185478973/images/big/1.webp",
				alias: "promotion-product-4",
				article: 3412313413123,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок, с одним вместительным отделением для учебных пособий форматом А4, имеет удобную внутреннюю организацию пространства, позволяющую распределить вещи с максимальным комфортом. Его размер 42х30х13см. В основном отделении есть карман для планшета или ноутбука до 16 дюймов, по бокам два кармана на резинке, один внешний на молнии и на спинке потайной для денег, билетов или документов для лучшей сохранности. В боковой карман можно положить бутылку с водой, поэтому отлично подойдет как спортивный рюкзак для похода в бассейн, на тренировку. Черный женский рюкзак имеет качественную фурнитуру, а материалом изготовления является нейлон-полиэстер, что делает его особенно мягким и лёгким. Ткань плотная и водонепроницаемая. Лямки мягкие и регулируются по длине, благодаря чему не давят на плечи. Такой модный легкий рюкзачок из текстиля понравится, как детям, подросткам, так и женщинам. Однотонный рюкзак или с принтом подходит девочкам как для школы с 3 класса, так и для дополнительных занятий. Он универсальный, представлен в 10 расцветках. Носите ране",
				images: [
					"https://basket-12.wbbasket.ru/vol1854/part185478/185478973/images/big/5.webp",
					"https://basket-12.wbbasket.ru/vol1854/part185478/185478973/images/big/4.webp",
					"https://basket-12.wbbasket.ru/vol1854/part185478/185478977/images/big/5.webp",
				],
				price: 5042,
				subtitle: "Рюкзак спортивный для ноутбука",
				rating: 4.2,
				discount: 12,
				isHit: true,
				new: true,
			},
			{
				id: 2,
				title: "Fahrenheit Dior парфюмерная вода 100 мл",
				poster:
					"https://basket-12.wbbasket.ru/vol1871/part187149/187149230/images/big/1.webp",
				alias: "promotion-product-5",
				article: 3412313413123,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок, с одним вместительным отделением для учебных пособий форматом А4, имеет удобную внутреннюю организацию пространства, позволяющую распределить вещи с максимальным комфортом. Его размер 42х30х13см. В основном отделении есть карман для планшета или ноутбука до 16 дюймов, по бокам два кармана на резинке, один внешний на молнии и на спинке потайной для денег, билетов или документов для лучшей сохранности. В боковой карман можно положить бутылку с водой, поэтому отлично подойдет как спортивный рюкзак для похода в бассейн, на тренировку. Черный женский рюкзак имеет качественную фурнитуру, а материалом изготовления является нейлон-полиэстер, что делает его особенно мягким и лёгким. Ткань плотная и водонепроницаемая. Лямки мягкие и регулируются по длине, благодаря чему не давят на плечи. Такой модный легкий рюкзачок из текстиля понравится, как детям, подросткам, так и женщинам. Однотонный рюкзак или с принтом подходит девочкам как для школы с 3 класса, так и для дополнительных занятий. Он универсальный, представлен в 10 расцветках. Носите ране",
				images: [
					"https://basket-12.wbbasket.ru/vol1871/part187149/187149230/images/big/2.webp",
					"https://basket-12.wbbasket.ru/vol1871/part187149/187149230/images/big/1.webp",
				],
				price: 1231,
				subtitle: "Fahrenheit Dior парфюмерная вода 100 мл",
				rating: 4.2,
				discount: 2,
				isHit: true,
				new: false,
			},
			{
				id: 3,
				title: "212 VIP Men",
				poster:
					"https://basket-12.wbbasket.ru/vol1854/part185440/185440016/images/big/1.webp",
				alias: "promotion-product-6",
				article: 3412313413123,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок, с одним вместительным отделением для учебных пособий форматом А4, имеет удобную внутреннюю организацию пространства, позволяющую распределить вещи с максимальным комфортом. Его размер 42х30х13см. В основном отделении есть карман для планшета или ноутбука до 16 дюймов, по бокам два кармана на резинке, один внешний на молнии и на спинке потайной для денег, билетов или документов для лучшей сохранности. В боковой карман можно положить бутылку с водой, поэтому отлично подойдет как спортивный рюкзак для похода в бассейн, на тренировку. Черный женский рюкзак имеет качественную фурнитуру, а материалом изготовления является нейлон-полиэстер, что делает его особенно мягким и лёгким. Ткань плотная и водонепроницаемая. Лямки мягкие и регулируются по длине, благодаря чему не давят на плечи. Такой модный легкий рюкзачок из текстиля понравится, как детям, подросткам, так и женщинам. Однотонный рюкзак или с принтом подходит девочкам как для школы с 3 класса, так и для дополнительных занятий. Он универсальный, представлен в 10 расцветках. Носите ране",
				images: [
					"https://basket-12.wbbasket.ru/vol1854/part185440/185440016/images/big/1.webp",
				],
				price: 1500,
				subtitle: "212 VIP Men",
				rating: 4.2,
				discount: 22,
				isHit: true,
				new: false,
			},
		],
	},
	{
		id: 3,
		name: "Мужские часы с большой скидкой!",
		alias: "promotion-3",
		image:
			"https://images.pexels.com/photos/9980799/pexels-photo-9980799.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
		products: [
			{
				id: 1,
				title: "Часы наручные кварцевые браслет",
				poster:
					"https://basket-12.wbbasket.ru/vol1728/part172888/172888214/images/big/1.webp",
				alias: "promotion-product-7",
				article: 23432423435645,
				description:
					"Элегантные мужские наручные часы напоминают известный бренд Casio представляют собой идеальный подарок для мужчин на любой праздник. Будь то Новый Год, день рождения или просто особенный день - эти часы станут уникальным и запоминающимся сюрпризом. Данная модель часов отличается своим классическим дизайном, который не выходит из моды. Именно это делает их универсальным аксессуаром, подходящим к любому образу и стилю. В комплекте с часами идёт металлический ремешок, что позволяет легко настроить их под любой образ и ситуацию. Это позволяет избежать моноотонности и дает возможность варьировать внешний вид часов, в зависимости от настроения или стиля одежды. Такой подарок будет актуален как для папы, так и для парня или даже молодого подростка. Эти часы - не просто украшение на руку. Это стильный и функциональный аксессуар, который подчеркнет вкус и статус его владельца. Они станут отличным дополнением к образу, подчеркнут индивидуальность и выделют из толпы. Casio - это бренд, который на протяжении многих лет известен своими надежными и качественными часами. Используя передовые технологии и высококачественные материалы, компания создает часы, которые не только выглядят стильно, но и обеспечивают точное время. Они - отличный выбор для тех кто ищет сочетание стиля, функциональности и долговечности. Такие часы - это не просто способ узнать время, это произведение искусства, которое можно носить на руке. Они добавят шарма и уверенности в себе любому мужчине, будь то бизнесмен, студент или даже школьник. Наручные часы Casio - это символ качества, надежности и превосходного вкуса.					",
				images: [
					"https://basket-12.wbbasket.ru/vol1728/part172888/172888214/images/big/2.webp",
					"https://basket-12.wbbasket.ru/vol1728/part172888/172888214/images/big/4.webp",
					"https://basket-12.wbbasket.ru/vol1728/part172888/172888214/images/big/6.webp",
				],
				price: 3250,
				subtitle: "Часы наручные кварцевые браслет",
				rating: 3.2,
				discount: 50,
				isHit: true,
				new: true,
			},
			{
				id: 2,
				title: "Часы наручные армейские авиаторы тактические спортивные",
				poster:
					"https://basket-12.wbbasket.ru/vol1827/part182792/182792156/images/big/3.webp",
				alias: "promotion-product-8",
				article: 987238423,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок, с одним вместительным отделением для учебных пособий форматом А4, имеет удобную внутреннюю организацию пространства, позволяющую распределить вещи с максимальным комфортом. Его размер 42х30х13см. В основном отделении есть карман для планшета или ноутбука до 16 дюймов, по бокам два кармана на резинке, один внешний на молнии и на спинке потайной для денег, билетов или документов для лучшей сохранности. В боковой карман можно положить бутылку с водой, поэтому отлично подойдет как спортивный рюкзак для похода в бассейн, на тренировку. Черный женский рюкзак имеет качественную фурнитуру, а материалом изготовления является нейлон-полиэстер, что делает его особенно мягким и лёгким. Ткань плотная и водонепроницаемая. Лямки мягкие и регулируются по длине, благодаря чему не давят на плечи. Такой модный легкий рюкзачок из текстиля понравится, как детям, подросткам, так и женщинам. Однотонный рюкзак или с принтом подходит девочкам как для школы с 3 класса, так и для дополнительных занятий. Он универсальный, представлен в 10 расцветках. Носите ране",
				images: [
					"https://basket-12.wbbasket.ru/vol1827/part182792/182792156/images/big/2.webp",
					"https://basket-12.wbbasket.ru/vol1827/part182792/182792156/images/big/5.webp",
					"https://basket-12.wbbasket.ru/vol1827/part182792/182792156/images/big/6.webp",
					"https://basket-12.wbbasket.ru/vol1827/part182792/182792156/images/big/7.webp",
				],
				price: 23423,
				subtitle: "Часы наручные армейские авиаторы тактические спортивные",
				rating: 4.2,
				discount: 22,
				isHit: false,
				new: true,
			},
			{
				id: 3,
				title: "Часы наручные с электронным циферблатом",
				poster:
					"https://basket-10.wbbasket.ru/vol1565/part156594/156594983/images/big/1.webp",
				alias: "promotion-product-9",
				article: 3412313413123,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок, с одним вместительным отделением для учебных пособий форматом А4, имеет удобную внутреннюю организацию пространства, позволяющую распределить вещи с максимальным комфортом. Его размер 42х30х13см. В основном отделении есть карман для планшета или ноутбука до 16 дюймов, по бокам два кармана на резинке, один внешний на молнии и на спинке потайной для денег, билетов или документов для лучшей сохранности. В боковой карман можно положить бутылку с водой, поэтому отлично подойдет как спортивный рюкзак для похода в бассейн, на тренировку. Черный женский рюкзак имеет качественную фурнитуру, а материалом изготовления является нейлон-полиэстер, что делает его особенно мягким и лёгким. Ткань плотная и водонепроницаемая. Лямки мягкие и регулируются по длине, благодаря чему не давят на плечи. Такой модный легкий рюкзачок из текстиля понравится, как детям, подросткам, так и женщинам. Однотонный рюкзак или с принтом подходит девочкам как для школы с 3 класса, так и для дополнительных занятий. Он универсальный, представлен в 10 расцветках. Носите ране",
				images: [
					"https://basket-10.wbbasket.ru/vol1565/part156594/156594983/images/big/4.webp",
					"https://basket-10.wbbasket.ru/vol1565/part156594/156594983/images/big/1.webp",
				],
				price: 1228,
				subtitle: "Часы наручные с электронным циферблатом",
				rating: 3.2,
				discount: 15,
				isHit: false,
				new: false,
			},
		],
	},
	{
		id: 4,
		name: "Все для женщин!",
		alias: "promotion-4",
		description: "Скидки до 55% в честь 8-го марта!",
		image:
			"https://images.pexels.com/photos/4149012/pexels-photo-4149012.jpeg?auto=compress&cs=tinysrgb&w=600",
		products: [
			{
				id: 1,
				title: "Худи оверсайз с капюшоном теплое",
				poster:
					"https://basket-12.wbbasket.ru/vol1811/part181129/181129722/images/big/1.webp",
				alias: "promotion-product-10",
				article: 23411313123,
				description:
					"Худи женское с капюшоном утепленное. Обратите внимание!!! Для футера допустимо образование на внутренней стороне так называемых",
				images: [
					"https://basket-12.wbbasket.ru/vol1811/part181129/181129722/images/big/2.webp",
					"https://basket-12.wbbasket.ru/vol1811/part181129/181129722/images/big/3.webp",
					"https://basket-12.wbbasket.ru/vol1811/part181129/181129722/images/big/4.webp",
					"https://basket-12.wbbasket.ru/vol1811/part181129/181129722/images/big/5.webp",
				],
				price: 23454,
				subtitle: "Худи оверсайз с капюшоном теплое",
				rating: 4.2,
				discount: 40,
				isHit: false,
				new: true,
			},
			{
				id: 2,
				title: "Худи теплое оверсайз",
				poster:
					"https://basket-12.wbbasket.ru/vol1758/part175859/175859353/images/big/1.webp",
				alias: "promotion-product-11",
				article: 23423423476,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок, с одним вместительным отделением для учебных пособий форматом А4, имеет удобную внутреннюю организацию пространства, позволяющую распределить вещи с максимальным комфортом. Его размер 42х30х13см. В основном отделении есть карман для планшета или ноутбука до 16 дюймов, по бокам два кармана на резинке, один внешний на молнии и на спинке потайной для денег, билетов или документов для лучшей сохранности. В боковой карман можно положить бутылку с водой, поэтому отлично подойдет как спортивный рюкзак для похода в бассейн, на тренировку. Черный женский рюкзак имеет качественную фурнитуру, а материалом изготовления является нейлон-полиэстер, что делает его особенно мягким и лёгким. Ткань плотная и водонепроницаемая. Лямки мягкие и регулируются по длине, благодаря чему не давят на плечи. Такой модный легкий рюкзачок из текстиля понравится, как детям, подросткам, так и женщинам. Однотонный рюкзак или с принтом подходит девочкам как для школы с 3 класса, так и для дополнительных занятий. Он универсальный, представлен в 10 расцветках. Носите ране",
				images: [
					"https://basket-12.wbbasket.ru/vol1758/part175859/175859353/images/big/3.webp",
					"https://basket-12.wbbasket.ru/vol1758/part175859/175859353/images/big/2.webp",
					"https://basket-12.wbbasket.ru/vol1758/part175859/175859353/images/big/4.webp",
					"https://basket-12.wbbasket.ru/vol1758/part175859/175859353/images/big/5.webp",
				],
				price: 6453,
				subtitle: "Худи теплое оверсайз",
				rating: 4.2,
				discount: 34,
				isHit: true,
				new: false,
			},
			{
				id: 3,
				title: "Кардиган на пуговицах укороченный оверсайз вязаный",
				poster:
					"https://basket-04.wbbasket.ru/vol461/part46139/46139980/images/big/2.webp",
				alias: "promotion-product-12",
				article: 235635476,
				description:
					"Стильный городской рюкзак создан специально для повседневной жизни. Рюкзак школьный с котом с пеналом в подарок, с одним вместительным отделением для учебных пособий форматом А4, имеет удобную внутреннюю организацию пространства, позволяющую распределить вещи с максимальным комфортом. Его размер 42х30х13см. В основном отделении есть карман для планшета или ноутбука до 16 дюймов, по бокам два кармана на резинке, один внешний на молнии и на спинке потайной для денег, билетов или документов для лучшей сохранности. В боковой карман можно положить бутылку с водой, поэтому отлично подойдет как спортивный рюкзак для похода в бассейн, на тренировку. Черный женский рюкзак имеет качественную фурнитуру, а материалом изготовления является нейлон-полиэстер, что делает его особенно мягким и лёгким. Ткань плотная и водонепроницаемая. Лямки мягкие и регулируются по длине, благодаря чему не давят на плечи. Такой модный легкий рюкзачок из текстиля понравится, как детям, подросткам, так и женщинам. Однотонный рюкзак или с принтом подходит девочкам как для школы с 3 класса, так и для дополнительных занятий. Он универсальный, представлен в 10 расцветках. Носите ране",
				images: [
					"https://basket-04.wbbasket.ru/vol461/part46139/46139980/images/big/2.webp",
					"https://basket-04.wbbasket.ru/vol461/part46139/46139980/images/big/6.webp",
					"https://basket-04.wbbasket.ru/vol461/part46139/46139980/images/big/7.webp",
					"https://basket-04.wbbasket.ru/vol461/part46139/46139980/images/big/8.webp",
				],
				price: 3456,
				subtitle: "Кардиган на пуговицах укороченный оверсайз вязаный",
				rating: 4.1,
				discount: 34,
				isHit: false,
				new: true,
			},
		],
	},
]
