import { IProduct } from "@/interfaces/product.interface"

export const CARDS_PRODUCT: IProduct[] = [
	{
		id: 1,
		title: "Кеды ADVANTAGE    ",
		description:
			"РАЗМЕР ПРОИЗВОДИТЕЛЯ = UK РАЗМЕР. ОРИГИНАЛЬНАЯ ПРОДУКЦИЯ ADIDAS. Эти кеды в теннисном стиле от adidas сочетают классический внешний вид с современным комфортом. Шнуровка обеспечивает мягкую, но плотную посадку, которая естественно облегает вашу ногу. Уверенно ступайте с надежным сцеплением на любой поверхности. Обычная посадка. Синтетический верх. Текстильная подкладка. Удобная стелька Cloudfoam. Резиновая подошва.    ",
		poster:
			"https://basket-11.wbbasket.ru/vol1618/part161824/161824021/images/big/4.webp",
		article: 1324234234234,
		images: [
			"https://basket-11.wbbasket.ru/vol1618/part161824/161824021/images/big/3.webp",
			"https://basket-11.wbbasket.ru/vol1618/part161824/161824021/images/big/4.webp",
			"https://basket-11.wbbasket.ru/vol1618/part161824/161824021/images/big/5.webp",
			"https://basket-11.wbbasket.ru/vol1618/part161824/161824021/images/big/7.webp",
		],
		price: 2022,
		rating: 3.4,
		new: true,
		discount: 12,
	},
	{
		id: 2,
		title: "Кеды AIR FORCE",
		description:
			"Вся информация основывается на последних сведениях от производителя    ",
		poster:
			"https://basket-11.wbbasket.ru/vol1612/part161286/161286292/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-11.wbbasket.ru/vol1612/part161286/161286292/images/big/2.webp",
			"https://basket-11.wbbasket.ru/vol1612/part161286/161286292/images/big/3.webp",
			"https://basket-11.wbbasket.ru/vol1612/part161286/161286292/images/big/4.webp",
			"https://basket-11.wbbasket.ru/vol1612/part161286/161286292/images/big/5.webp",
		],
		price: 3022,
		rating: 2.3,
		new: false,
		discount: 15,
	},
	{
		id: 3,
		title: "Кеды AIR FORCE",
		description:
			"Вся информация основывается на последних сведениях от производителя    ",
		poster:
			"https://basket-11.wbbasket.ru/vol1612/part161286/161286292/images/big/2.webp",
		article: 1324234234234,
		images: [
			"https://basket-12.wbbasket.ru/vol1714/part171493/171493980/images/big/3.webp",
			"https://basket-12.wbbasket.ru/vol1714/part171493/171493980/images/big/4.webp",
			"https://basket-12.wbbasket.ru/vol1714/part171493/171493980/images/big/5.webp",
			"https://basket-12.wbbasket.ru/vol1714/part171493/171493980/images/big/6.webp",
		],
		price: 3022,
		rating: 3.8,
		discount: 20,
		new: true,
	},
	{
		id: 4,
		title: "Куртка зимняя длинная    ",
		description:
			"Представляем вашему вниманию уникальную мужскую зимнюю куртку, разработанную специально для активных и стильных мужчин, которые ценят комфорт и функциональность в одежде. Мужской пуховик - идеальный выбор для зимнего сезона 2023-2024 года. Эта удлиненная классическая модель станет вашим незаменимым спутником в холодное время года, обеспечивая тепло и уют даже при очень низкой температуре.Отличительной особенностью куртки являются съемный капюшон на кулиске и воротник-стойка. Ветрозащитный клапан гарантирует дополнительную защиту от ветра и холода.Мужская молодежная куртка длиной 100 см оснащена прорезными карманами на молнии и втачными рукавами с манжетами.Однотонная модель утепленного пуховика имеет стеганую фактуру, что делает ее модной и универсальной, подходящей для различных образов и случаев. Подростковая куртка не сковывает движений, благодаря боковым молниям по низу, которые позволяют регулировать ширину подола. А утеплитель из био-пуха обеспечивает непревзойденную теплоизоляцию даже при самых низких температурах.Добавляй наш бренд в любимые и оставайся в курсе новинок и распродаж.    ",
		poster:
			"https://basket-05.wbbasket.ru/vol945/part94563/94563844/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-05.wbbasket.ru/vol945/part94563/94563844/images/big/2.webp",
			"https://basket-05.wbbasket.ru/vol945/part94563/94563844/images/big/5.webp",
			"https://basket-05.wbbasket.ru/vol945/part94563/94563844/images/big/6.webp",
			"https://basket-05.wbbasket.ru/vol945/part94563/94563844/images/big/7.webp",
		],
		price: 3022,
		rating: 4.5,
		new: false,
	},
	{
		id: 5,
		title: "Куртка зимняя длинная    ",
		description:
			"Представляем вашему вниманию уникальную мужскую зимнюю куртку, разработанную специально для активных и стильных мужчин, которые ценят комфорт и функциональность в одежде. Мужской пуховик - идеальный выбор для зимнего сезона 2023-2024 года. Эта удлиненная классическая модель станет вашим незаменимым спутником в холодное время года, обеспечивая тепло и уют даже при очень низкой температуре.Отличительной особенностью куртки являются съемный капюшон на кулиске и воротник-стойка. Ветрозащитный клапан гарантирует дополнительную защиту от ветра и холода.Мужская молодежная куртка длиной 100 см оснащена прорезными карманами на молнии и втачными рукавами с манжетами.Однотонная модель утепленного пуховика имеет стеганую фактуру, что делает ее модной и универсальной, подходящей для различных образов и случаев. Подростковая куртка не сковывает движений, благодаря боковым молниям по низу, которые позволяют регулировать ширину подола. А утеплитель из био-пуха обеспечивает непревзойденную теплоизоляцию даже при самых низких температурах.Добавляй наш бренд в любимые и оставайся в курсе новинок и распродаж.    ",
		poster:
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/2.webp",
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/4.webp",
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/5.webp",
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/6.webp",
		],
		price: 3022,
		rating: 4.2,
		new: true,
		discount: 10,
	},
	{
		id: 6,
		title: "Пуховик зимний длинный оверсайз с капюшоном    ",
		description:
			"Представляем вашему вниманию уникальную мужскую зимнюю куртку, разработанную специально для активных и стильных мужчин, которые ценят комфорт и функциональность в одежде. Мужской пуховик - идеальный выбор для зимнего сезона 2023-2024 года. Эта удлиненная классическая модель станет вашим незаменимым спутником в холодное время года, обеспечивая тепло и уют даже при очень низкой температуре.Отличительной особенностью куртки являются съемный капюшон на кулиске и воротник-стойка. Ветрозащитный клапан гарантирует дополнительную защиту от ветра и холода.Мужская молодежная куртка длиной 100 см оснащена прорезными карманами на молнии и втачными рукавами с манжетами.Однотонная модель утепленного пуховика имеет стеганую фактуру, что делает ее модной и универсальной, подходящей для различных образов и случаев. Подростковая куртка не сковывает движений, благодаря боковым молниям по низу, которые позволяют регулировать ширину подола. А утеплитель из био-пуха обеспечивает непревзойденную теплоизоляцию даже при самых низких температурах.Добавляй наш бренд в любимые и оставайся в курсе новинок и распродаж.    ",
		poster:
			"https://basket-06.wbbasket.ru/vol1023/part102336/102336723/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-06.wbbasket.ru/vol1023/part102336/102336723/images/big/7.webp",
			"https://basket-06.wbbasket.ru/vol1023/part102336/102336723/images/big/8.webp",
			"https://basket-06.wbbasket.ru/vol1023/part102336/102336723/images/big/11.webp",
			"https://basket-06.wbbasket.ru/vol1023/part102336/102336723/images/big/12.webp",
		],
		price: 3022,
		rating: 4.0,
		new: false,
	},
	{
		id: 7,
		title: "Стол обеденный Раздвижной Beneli Стенли.    ",
		description:
			"Стильный стол Стенли с принтом столешницы под мрамор идеально дополнит современный дизайн интерьера вашей гостиной или кухни. Столешница имеет стеклянную поверхность, что придает столу удобство и простоту использования. Размер в разложенном виде: 1400 x 750 x 1000 мм Размер (Ш*В*Г): 1000 x 750 x 1000 мм Материал ножек: Металл, матовая окраска Материал столешницы: МДФ + стекло (фотопечать) Механизм: раздвижной Серия: Стенли Вес изделия, кг: 30    ",
		poster:
			"https://basket-12.wbbasket.ru/vol1687/part168705/168705407/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-12.wbbasket.ru/vol1687/part168705/168705407/images/big/2.webp",
			"https://basket-12.wbbasket.ru/vol1687/part168705/168705407/images/big/3.webp",
			"https://basket-12.wbbasket.ru/vol1687/part168705/168705407/images/big/4.webp",
			"https://basket-12.wbbasket.ru/vol1687/part168705/168705407/images/big/5.webp",
		],
		price: 3022,
		new: false,
		discount: 40,

		rating: 3.8,
	},
	{
		id: 8,
		title: "iPhone 15 128GB    ",
		description:
			"Спецификация модели - A3092. Смартфон Apple iPhone 15 Green. OLED-дисплей Super Retina XDR с диагональю 6,1 дюйма обеспечивает несравнимое качество изображения. Каждая фотография или видеоролик проигрываются с невероятной детализацией и цветопередачей. Система двойной камеры 48+12 Мп и новые функции по улучшению изображения и ночной съемки позволят создавать яркие и четкие фотографии в любых условиях. Мощный шестиядерный процессор A16 Bionic обеспечивает сверхбыструю обработку данных, плавную работу приложений и эффективное энергосбережение. Поддержка Wi‑Fi 6 для быстрого и стабильного интернет-соединения, Bluetooth 5.3 для связи с совместимыми устройствами и универсальный разъем Type-C для зарядки и передачи данных.    ",
		poster:
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/2.webp",
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/3.webp",
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/4.webp",
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/5.webp",
		],
		price: 3022,
		rating: 3.1,
		new: true,
	},
	{
		id: 9,
		title: "MacBook Air 13/M2/8/256 (Space Grey)    ",
		description:
			"Американская версия - клавиатура без русских букв, американская вилка (переходник на евро вилку в комплект не входит). Супербыстрые процессоры M2, разработанные специально для профессионалов. Они дают феноменальную производительность и обеспечивают удивительно долгое время работы без подзарядки. Прибавьте к этому потрясающий дисплей Retina, превосходную камеру и звук. С этим ноутбуком всё становится возможным. Невероятная детализация в темных областях, более глубокий черный, а остальные цвета - яркие как никогда.    ",
		poster:
			"https://basket-12.wbbasket.ru/vol1722/part172232/172232336/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-12.wbbasket.ru/vol1722/part172232/172232336/images/big/7.webp",
		],
		price: 3022,
		rating: 3.2,
		new: false,
		discount: 8,
	},
	{
		id: 10,
		title: "Ноутбук Chuwi GemiBook Xpro 14.1",
		description:
			"Американская версия - клавиатура без русских букв, американская вилка (переходник на евро вилку в комплект не входит). Супербыстрые процессоры M2, разработанные специально для профессионалов. Они дают феноменальную производительность и обеспечивают удивительно долгое время работы без подзарядки. Прибавьте к этому потрясающий дисплей Retina, превосходную камеру и звук. С этим ноутбуком всё становится возможным. Невероятная детализация в темных областях, более глубокий черный, а остальные цвета - яркие как никогда.    ",
		poster:
			"https://basket-10.wbbasket.ru/vol1517/part151775/151775685/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-10.wbbasket.ru/vol1517/part151775/151775685/images/big/2.webp",
			"https://basket-10.wbbasket.ru/vol1517/part151775/151775685/images/big/3.webp",
			"https://basket-10.wbbasket.ru/vol1517/part151775/151775685/images/big/4.webp",
		],
		price: 3022,
		rating: 4.0,
		new: false,
	},
	{
		id: 11,
		title: "Куртка зимняя длинная    ",
		description:
			"Представляем вашему вниманию уникальную мужскую зимнюю куртку, разработанную специально для активных и стильных мужчин, которые ценят комфорт и функциональность в одежде. Мужской пуховик - идеальный выбор для зимнего сезона 2023-2024 года. Эта удлиненная классическая модель станет вашим незаменимым спутником в холодное время года, обеспечивая тепло и уют даже при очень низкой температуре.Отличительной особенностью куртки являются съемный капюшон на кулиске и воротник-стойка. Ветрозащитный клапан гарантирует дополнительную защиту от ветра и холода.Мужская молодежная куртка длиной 100 см оснащена прорезными карманами на молнии и втачными рукавами с манжетами.Однотонная модель утепленного пуховика имеет стеганую фактуру, что делает ее модной и универсальной, подходящей для различных образов и случаев. Подростковая куртка не сковывает движений, благодаря боковым молниям по низу, которые позволяют регулировать ширину подола. А утеплитель из био-пуха обеспечивает непревзойденную теплоизоляцию даже при самых низких температурах.Добавляй наш бренд в любимые и оставайся в курсе новинок и распродаж.    ",
		poster:
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/2.webp",
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/4.webp",
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/5.webp",
			"https://basket-05.wbbasket.ru/vol972/part97209/97209381/images/big/6.webp",
		],
		discount: 5,
		price: 3022,
		rating: 4.1,
		new: false,
	},
	{
		id: 12,
		title: "iPhone 15 128GB    ",
		description:
			"Спецификация модели - A3092. Смартфон Apple iPhone 15 Green. OLED-дисплей Super Retina XDR с диагональю 6,1 дюйма обеспечивает несравнимое качество изображения. Каждая фотография или видеоролик проигрываются с невероятной детализацией и цветопередачей. Система двойной камеры 48+12 Мп и новые функции по улучшению изображения и ночной съемки позволят создавать яркие и четкие фотографии в любых условиях. Мощный шестиядерный процессор A16 Bionic обеспечивает сверхбыструю обработку данных, плавную работу приложений и эффективное энергосбережение. Поддержка Wi‑Fi 6 для быстрого и стабильного интернет-соединения, Bluetooth 5.3 для связи с совместимыми устройствами и универсальный разъем Type-C для зарядки и передачи данных.    ",
		poster:
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/1.webp",
		article: 1324234234234,
		images: [
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/2.webp",
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/3.webp",
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/4.webp",
			"https://basket-12.wbbasket.ru/vol1771/part177120/177120727/images/big/5.webp",
		],
		price: 3022,
		rating: 4.8,
		new: true,
	},
]
